newwms_gift/src/Documents/ПеремещениеТоваров/ПеремещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеТоваров</name>
  <basedOn>Document.итWMSПеремещение</basedOn>
  <basedOn>Document.итWMSРучноеПеремещение</basedOn>
  <basedOn>Document.итWMSИзменениеПараметровТовараВЯчейках</basedOn>
  <basedOn>Document.итWMSСписаниеТовара</basedOn>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/Documents/итWMSПеремещение/итWMSПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итWMSПеремещение</name>
  <registerRecords>AccumulationRegister.итТоварыВЯчейках</registerRecords>
  <attributes>
    <name>итОснование</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.итWMSНаборка</types>
      <types>DocumentRef.ит_WMS_УстановкаСоответсвийНоменклатурыИАссортиментногоУчастка</types>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СнимокТабличнойЧастиДоРаспределения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаспределятьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеВПикинг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладскоеПомещениеПеремещения</name>
    <type>
      <types>CatalogRef.итСкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтратегияПеремещения</name>
    <type>
      <types>CatalogRef.итWMSСтратегии</types>
    </type>
  </attributes>
  <attributes>
    <name>ПополнениеСтока</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзъятиеТовараИзНаборки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыСтратегии</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресХраненияПараметров</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаОтправитель</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПолучатель</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗадачи</name>
      <type>
        <types>EnumRef.итWMSСостоянияЗадачТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковкиПолучатель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтменыЗадачи</name>
      <type>
        <types>CatalogRef.итWMS_ПричиныОтменыЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>ФиксацияСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИсполнения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/Documents/итWMSРучноеПеремещение/итWMSРучноеПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итWMSРучноеПеремещение</name>
  <registerRecords>AccumulationRegister.итТоварыВЯчейках</registerRecords>
  <attributes>
    <name>итОснование</name>
    <type>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтратегияПеремещения</name>
    <type>
      <types>CatalogRef.итWMSСтратегии</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладскоеПомещениеПеремещения</name>
    <type>
      <types>CatalogRef.итСкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресХраненияПараметров</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыСтратегии</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаОтправитель</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПолучатель</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковкиПолучатель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/Documents/итWMSСписаниеТовара/итWMSСписаниеТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итWMSСписаниеТовара</name>
  <basedOn>Document.СписаниеТоваров</basedOn>
  <basedOn>Document.итWMSНаборка</basedOn>
  <registerRecords>AccumulationRegister.итТоварыВЯчейках</registerRecords>
  <attributes>
    <name>итОснование</name>
    <type>
      <types>DocumentRef.итWMSДанныеИнвентаризации</types>
      <types>DocumentRef.итWMSКонтрольнаяОперацияАгрегации</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.итWMSРазмещение</types>
      <types>DocumentRef.итWMSИзменениеПараметровТовараВЯчейках</types>
      <types>DocumentRef.итWMSНаборка</types>
      <types>DocumentRef.итWMSДокументСвободнойАгрегации</types>
      <types>DocumentRef.итWMSПеремещение</types>
      <types>DocumentRef.итWMSОтгрузка</types>
      <types>DocumentRef.СписаниеТоваров</types>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданНаОснованиСерверногоВызова</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/Documents/ПеремещениеТоваров/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.итWMSПеремещение") 
		или ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.итWMSИзменениеПараметровТовараВЯчейках") 
			или ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.итWMSСписаниеТовара")
			Тогда 
		ЗаполнитьнаОснованииWMS(ДанныеЗаполнения);
	КонецЕсли;	

	КонецПроцедуры
	
Процедура ЗаполнитьнаОснованииWMS(ДанныеЗаполнения)
	Если ПроверкаНаНаличиеПеремещенияПоОснованию(ДанныеЗаполнения) Тогда 
		Сообщить("У основания уже имеется проведенное перемещение");
		Возврат;
	КонецЕсли;
	Если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.итWMSСписаниеТовара") Тогда 
	СкладОтправитель=ДанныеЗаполнения.Склад;
	СкладПолучатель=ДанныеЗаполнения.Склад;
        иначе
	СкладОтправитель=ДанныеЗаполнения.СкладОтправитель;
	СкладПолучатель=ДанныеЗаполнения.СкладПолучатель;
	КонецЕсли;
	Если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.итWMSИзменениеПараметровТовараВЯчейках") Тогда 
	Организация=ДанныеЗаполнения.ОрганизацияОтправитель;
	иначе
	Организация=ДанныеЗаполнения.Организация;
	КонецЕсли;
	Основание=ДанныеЗаполнения;
	Дата=ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итWMSПеремещениеТовары.Номенклатура КАК Номенклатура,
		|	итWMSПеремещениеТовары.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ВЫБОР
		|		КОГДА итWMSПеремещениеТовары.Качество = ЗНАЧЕНИЕ(Справочник.Качество.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Качество.новый)
		|		ИНАЧЕ итWMSПеремещениеТовары.Качество
		|	КОНЕЦ КАК Качество,
		|	СУММА(ВЫБОР
		|			КОГДА итWMSПеремещениеТовары.ФиксацияСтроки
		|				ТОГДА итWMSПеремещениеТовары.КоличествоФакт
		|			ИНАЧЕ итWMSПеремещениеТовары.Количество
		|		КОНЕЦ) КАК Количество,
		|	итWMSПеремещениеТовары.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
		|	итWMSПеремещениеТовары.Номенклатура.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
		|	итWMSПеремещениеТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Коэффициент,
		|	итWMSПеремещениеТовары.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент КАК КоэффициентМест,
		|	итWMSПеремещениеТовары.Характеристика КАК ХарактеристикаНоменклатуры
		|ИЗ
		|	Документ.итWMSПеремещение.Товары КАК итWMSПеремещениеТовары
		|ГДЕ
		|	итWMSПеремещениеТовары.Ссылка.Проведен
		|	И итWMSПеремещениеТовары.СостояниеЗадачи <> ЗНАЧЕНИЕ(Перечисление.итwmsсостоянияЗадачТсд.Отменена)
		|	И итWMSПеремещениеТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSПеремещениеТовары.Номенклатура,
		|	итWMSПеремещениеТовары.СерияНоменклатуры,
		|	ВЫБОР
		|		КОГДА итWMSПеремещениеТовары.Качество = ЗНАЧЕНИЕ(Справочник.Качество.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Качество.новый)
		|		ИНАЧЕ итWMSПеремещениеТовары.Качество
		|	КОНЕЦ,
		|	итWMSПеремещениеТовары.Номенклатура.ЕдиницаХраненияОстатков,
		|	итWMSПеремещениеТовары.Номенклатура.ЕдиницаИзмеренияМест,
		|	итWMSПеремещениеТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
		|	итWMSПеремещениеТовары.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент,
		|	итWMSПеремещениеТовары.Характеристика
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	итWMSРучноеПеремещениеТовары.Номенклатура,
		|	итWMSРучноеПеремещениеТовары.СерияНоменклатуры,
		|	ВЫБОР
		|		КОГДА итWMSРучноеПеремещениеТовары.Качество = ЗНАЧЕНИЕ(Справочник.Качество.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Качество.новый)
		|		ИНАЧЕ итWMSРучноеПеремещениеТовары.Качество
		|	КОНЕЦ,
		|	СУММА(итWMSРучноеПеремещениеТовары.Количество),
		|	итWMSРучноеПеремещениеТовары.Номенклатура.ЕдиницаХраненияОстатков,
		|	итWMSРучноеПеремещениеТовары.Номенклатура.ЕдиницаИзмеренияМест,
		|	итWMSРучноеПеремещениеТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
		|	итWMSРучноеПеремещениеТовары.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент,
		|	итWMSРучноеПеремещениеТовары.Характеристика
		|ИЗ
		|	Документ.итWMSРучноеПеремещение.Товары КАК итWMSРучноеПеремещениеТовары
		|ГДЕ
		|	итWMSРучноеПеремещениеТовары.Ссылка.Проведен
		|	И итWMSРучноеПеремещениеТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSРучноеПеремещениеТовары.Номенклатура,
		|	итWMSРучноеПеремещениеТовары.СерияНоменклатуры,
		|	ВЫБОР
		|		КОГДА итWMSРучноеПеремещениеТовары.Качество = ЗНАЧЕНИЕ(Справочник.Качество.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Качество.новый)
		|		ИНАЧЕ итWMSРучноеПеремещениеТовары.Качество
		|	КОНЕЦ,
		|	итWMSРучноеПеремещениеТовары.Номенклатура.ЕдиницаХраненияОстатков,
		|	итWMSРучноеПеремещениеТовары.Номенклатура.ЕдиницаИзмеренияМест,
		|	итWMSРучноеПеремещениеТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
		|	итWMSРучноеПеремещениеТовары.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент,
		|	итWMSРучноеПеремещениеТовары.Характеристика
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	итWMSИзменениеПараметровТовараВЯчейкахТовары.Номенклатура,
		|	итWMSИзменениеПараметровТовараВЯчейкахТовары.СерияНоменклатуры,
		|	ВЫБОР
		|		КОГДА итWMSИзменениеПараметровТовараВЯчейкахТовары.КачествоИзменения = ЗНАЧЕНИЕ(Справочник.Качество.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Качество.новый)
		|		ИНАЧЕ итWMSИзменениеПараметровТовараВЯчейкахТовары.КачествоИзменения
		|	КОНЕЦ,
		|	СУММА(итWMSИзменениеПараметровТовараВЯчейкахТовары.КоличествоИзменения),
		|	итWMSИзменениеПараметровТовараВЯчейкахТовары.Номенклатура.ЕдиницаХраненияОстатков,
		|	итWMSИзменениеПараметровТовараВЯчейкахТовары.Номенклатура.ЕдиницаИзмеренияМест,
		|	итWMSИзменениеПараметровТовараВЯчейкахТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
		|	итWMSИзменениеПараметровТовараВЯчейкахТовары.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент,
		|	итWMSИзменениеПараметровТовараВЯчейкахТовары.Характеристика
		|ИЗ
		|	Документ.итWMSИзменениеПараметровТовараВЯчейках.Товары КАК итWMSИзменениеПараметровТовараВЯчейкахТовары
		|ГДЕ
		|	итWMSИзменениеПараметровТовараВЯчейкахТовары.Ссылка = &Ссылка
		|	И итWMSИзменениеПараметровТовараВЯчейкахТовары.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSИзменениеПараметровТовараВЯчейкахТовары.Номенклатура,
		|	итWMSИзменениеПараметровТовараВЯчейкахТовары.СерияНоменклатуры,
		|	итWMSИзменениеПараметровТовараВЯчейкахТовары.Характеристика,
		|	итWMSИзменениеПараметровТовараВЯчейкахТовары.Номенклатура.ЕдиницаХраненияОстатков,
		|	итWMSИзменениеПараметровТовараВЯчейкахТовары.Номенклатура.ЕдиницаИзмеренияМест,
		|	итWMSИзменениеПараметровТовараВЯчейкахТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
		|	итWMSИзменениеПараметровТовараВЯчейкахТовары.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент,
		|	ВЫБОР
		|		КОГДА итWMSИзменениеПараметровТовараВЯчейкахТовары.КачествоИзменения = ЗНАЧЕНИЕ(Справочник.Качество.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Качество.новый)
		|		ИНАЧЕ итWMSИзменениеПараметровТовараВЯчейкахТовары.КачествоИзменения
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	итWMSСписаниеТовараТовары.Номенклатура,
		|	итWMSСписаниеТовараТовары.СерияНоменклатуры,
		|	ВЫБОР
		|		КОГДА итWMSСписаниеТовараТовары.Качество = ЗНАЧЕНИЕ(Справочник.Качество.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Качество.новый)
		|		ИНАЧЕ итWMSСписаниеТовараТовары.Качество
		|	КОНЕЦ,
		|	итWMSСписаниеТовараТовары.Количество,
		|	итWMSСписаниеТовараТовары.Номенклатура.ЕдиницаХраненияОстатков,
		|	итWMSСписаниеТовараТовары.Номенклатура.ЕдиницаИзмеренияМест,
		|	итWMSСписаниеТовараТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
		|	итWMSСписаниеТовараТовары.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент,
		|	итWMSСписаниеТовараТовары.Характеристика
		|ИЗ
		|	Документ.итWMSСписаниеТовара.Товары КАК итWMSСписаниеТовараТовары
		|ГДЕ
		|	итWMSСписаниеТовараТовары.Ссылка = &Ссылка
		|	И итWMSСписаниеТовараТовары.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока=Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	

	КонецПроцедуры
	
	
Функция ПроверкаНаНаличиеПеремещенияПоОснованию(СсылкаОснования)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.Основание = &Основание
		|	И ПеремещениеТоваров.Проведен";
	
	Запрос.УстановитьПараметр("Основание", СсылкаОснования);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат Истина;	
	КонецЦикла;
	Возврат Ложь;
	
КонецФункции
